#+title: Simulation Assignment 1
#+author: Luke Miller

#+PROPERTY: header-args:R  :session *R*
#+PROPERTY: header-args:R  :dir ~/projects/orsa-mac/orsa_mac/
#+OPTIONS: toc:nil
#+LATEX_HEADER: \usepackage[margin = 1in]{geometry}
#+LATEX_COMPILER: lualatex

** Simulation
:PROPERTIES:
:ID:       be0f664d-4c8a-45b5-b51f-58d238c99688
:END:
For this simulation, I am going to construct an empirical CDF by sorting the
observations then converting each step of observations into a line segment.
This will allow me to build a piecewise CDF across \([0-1]\) which I can then
solve for x in terms of R.

I will build this simulation in R.

#+name: ff_sim
#+begin_src R :var runs=100000 :session
ff_response_data <- c(2.76, 1.83, 0.80, 1.45, 1.24)

fire_fighter_response_simulator <- function(observed_times, runs) {

                                        # Validate Input
  if (!is.vector(observed_times) | !is.numeric(observed_times[1])) {
    stop("Please input a vector of observations of Firefighter Response Time.")
  }
  if (!is.numeric(runs) | it < 1) {
    stop("Iterations must be >= 1.")
  }

  x <- sort(observed_times)
  n <- length(x)
  diffs <- c(x[1], x[-1]-x[-n])
  m <- (1/n)/diffs
  y <- seq(1/n,1,1/n)
  b <- y-m*x


  rolls <- runif(runs)
  times <- NULL
  for (i in 1:runs) {
    times[i] <- (rolls[i]-b[ceiling(n*rolls[i])])/m[ceiling(n*rolls[i])]
  }

  return(list(times = times,
              mean = mean(times),
              max = max(times),
              min = min(times)))
}

set.seed(123)
ff_sim <- fire_fighter_response_simulator(ff_response_data, runs)
c(ff_sim$mean,ff_sim$max,ff_sim$min)
#+end_src

#+RESULTS: ff_sim
|     1.33881061031184 |
|     2.75996420826064 |
| 7.28219747543335e-05 |

** Simulation
:PROPERTIES:
:ID:       3854459f-52d9-44b8-b011-0d86acaf9426
:END:
I can model the arrival times to the ID card office with an exponential distribution solved for \(x\) in terms of \(R\): \(x=\frac{-ln(R)}{\lambda}\).

This is very similar to what we did in class with the coffee shop.

#+name: id_sim
#+begin_src R :session
set.seed(123)
n <- 100
mins <- 480

arrival_rolls <- runif(n)
lambda_arrivals <- 1/15
time_between_arrivals <- -log(arrival_rolls)/lambda_arrivals
arrival_clock <- cumsum(time_between_arrivals)

service_rolls <- runif(n)
lambda_service <- 1/12
service_times <- -log(service_rolls)/lambda_service

depart_clock <- NULL
begin_service_clock <- NULL
time_in_queue <- NULL
clerk_idle_time <- NULL
for (i in 1:n) {
  begin_service_clock[i] <- max(arrival_clock[i],depart_clock[i-1])
  time_in_queue[i] <- begin_service_clock[i]-arrival_clock[i]
  clerk_idle_time[i] <- begin_service_clock[i] - if(is.null(depart_clock)){0} else {depart_clock[i-1]}
  depart_clock[i] <- begin_service_clock[i] + service_times[i]
  if(depart_clock[i] > mins) {break}
}
clerk_utilization_rate <- sum(clerk_idle_time)/mins
list(clerk_utilization_rate = clerk_utilization_rate,
     max_time_in_queue = max(time_in_queue))
#+end_src

#+RESULTS: id_sim
| 0.294863193370666 | 72.8277499864645 |

** Simulation
:PROPERTIES:
:ID:       089933e0-a322-4dce-ae99-7cb9cf15a62e
:END:

#+name: missile_sim
#+begin_src R :session :var runs=100000
set.seed(123)
                                        # Initialize Out of Run Variables
missiles_by_run <- NULL
flight_time_beta <- 90
flight_time_lambda <- 1/flight_time_beta
time_per_attempt <- 60
hits_required <- 19
great_success <- 0.12
some_success <- 0.64 + great_success
great_success_hit_chance <- 0.95
some_success_hit_chance <- 0.75

                                        # Loop number of runs
for(i in 1:runs) {
                                        # Initialize Run Variables
  missiles_shot <- 0
  hits <- 0
                                        # Loop until required number of hits
  while(hits < hits_required) {
    flight_time <- -log(runif(1))/flight_time_lambda
    attempts <- ceiling(flight_time/time_per_attempt)
    hit_chance <- 0
    for (j in 1:attempts) {
      cm_roll <- runif(1)
      if (cm_roll < great_success) {
        hit_chance <- great_success_hit_chance
      } else if (cm_roll < some_success) {
        hit_chance <- some_success_hit_chance
        break
      } else {
        break
      }
    }
    to_hit_roll <- runif(1)
    if (to_hit_roll < hit_chance) {hits <- hits + 1}
    missiles_shot <- missiles_shot + 1
  }
  missiles_by_run[i] <- missiles_shot
}
data.frame(mean = mean(missiles_by_run),
           min = min(missiles_by_run),
           max = max(missiles_by_run),
           chance_of_19 = sum(missiles_by_run == 19)/runs)
#+end_src

#+RESULTS: missile_sim
| 32.45069 | 19 | 59 | 5e-05 |

